Tekla Open API Reference for Tekla Structures 2025
ComponentInput Methods
The ComponentInput type exposes the following members.
Methods
Name | Description
AddInputObject
 Adds a model object to the component input.
AddInputObjects
 Adds an array list of model objects to the component input.
AddInputPolygon
 Adds a polygon to the component input.
AddOneInputPosition
 Adds an input position to the component input.
AddTwoInputPositions
 Adds two input positions to the component input.
CopyTo
 Copies the elements of the ICollection to an Array, starting at a particular Array index.
GetEnumerator
 Returns an enumerator that iterates through a collection.
Top
See Also
Reference
ComponentInput Class
Tekla.Structures.Model Namespace